pratik-emacs.org
#+title: Pratik's Emacs configuration
#+author: Pratik Abhyankar

* Introduction

While majority of the configuration here comes from  my old 'illiterate' Emacs configuration, many parts of it, including the structure, is adapted from Vedang Manerikar's Emacs configuration for Unravel Team.

To make a change to this Emacs configuration, edit this file and then type =C-c C-v C-t= (=M-x org-babel-tangle=) to republish all the relevant files.

#+begin_src emacs-lisp :tangle no :results none
  (org-babel-tangle)
#+end_src


* The =early-init.el= file

This is the first file that Emacs reads when starting up. It should contain code that does not depend on any package or the proportions of the Emacs frame. In general, this early initialization file is meant to set up a few basic things before Emacs produces the initial frame by delegating to the =init.el=.

** The =early-init.el= file basic frame settings

#+begin_src emacs-lisp :tangle "early-init.el"
    ;; early-init.el -*- lexical-binding: t; -*-

  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b")
        debug-on-error t
        ring-bell-function 'ignore
        use-file-dialog nil
        use-short-answers t
        inhibit-startup-screen t
        inhibit-x-resources t
        inhibit-startup-echo-area-message user-login-name
        inhibit-startup-buffer-menu t)

  (push '(fullscreen . maximized) default-frame-alist)

  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
#+end_src

** The =early-init.el= file tweaks to startup time and garbage collection

Temporarily increase the garbage collection threshold to speed up Emacs startup time. Once started, reset the threshold to 50 MB.

#+begin_src emacs-lisp :tangle "early-init.el"
  (let ((gc-cons-threshold most-positive-fixnum)
        (gc-cons-percentage 0.6))

    (add-hook 'emacs-startup-hook
              (lambda ()
                (setq gc-cons-threshold (* 50 1000 1000))
                (setq gc-cons-percentage 0.1))))
#+end_src

** The =early-init.el= initializes package cache settings

Do not initialize the package cache. This configuration uses =elpaca= instead of =package.el=.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq package-enable-at-startup nil)
#+end_src

** =The early-init.el= file setting to load latest of =.el= or =.elc= files

When both =.el= and =.elc= files are available, load the latest one.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq load-prefer-newer t)
#+end_src

** Finally, the =early-init.el= local variable settings

This should be the last section of the ~early-init.el~ file.

#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Local Variables:
  ;; no-byte-compile: t
  ;; no-native-compile: t
  ;; no-update-autoloads: t
  ;; End:
#+end_src


* The =init.el= file

The main initialization file of Emacs. Everything loads from here, even if it has been split into multiple files for convenience.

** The =init.el= setting to disable backups and lockfiles

#+begin_src emacs-lisp :tangle "init.el"
  ;; init.el -*- lexical-binding: t; -*-

  (setq auto-save-default nil)
  (setq auto-save-list-file-prefix nil)
  (setq make-backup-files nil)
  (setq backup-inhibited nil) ; Not sure if needed, given `make-backup-files'
  (setq create-lockfiles nil)
#+end_src

** The =init.el= tweaks to make native compilation silent

Disable native compilation warnings. They are annoying and intrusive.

#+begin_src emacs-lisp :tangle "init.el"
    ;; Make native compilation silent and prune its cache.
  (when (native-comp-available-p)
    (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
    (setq native-compile-prune-cache t)) ; Emacs 29
#+end_src

** The =init.el= setting to send ~custom-file~ to oblivion

There is no need to use the =M-x customize= infrastructure. It's easier to just rely on the init file instead.

#+begin_src emacs-lisp :tangle "init.el"
  ;; Disable custom.el by making it disposable.
  (setq custom-file (make-temp-file "emacs-custom-file"))
#+end_src

** The =init.el= settings to enable commands disabled by default

These commands are actually useful, especially in org-mode.

#+begin_src emacs-lisp :tangle "init.el"
  ;; Enable these commands which have been disabled by default
  (mapc
   (lambda (command)
     (put command 'disabled nil))
   '(list-timers narrow-to-region narrow-to-page upcase-region downcase-region))
#+end_src

** The =init.el= settings to disable unnecessary commands enabled by default

These commands are "unsafe", in that we should be using the alternatives (like ~vterm~ and ~org~)

#+begin_src emacs-lisp :tangle "init.el"
  ;; Disable these commands which have been enabled by default
  (mapc
   (lambda (command)
     (put command 'disabled t))
   '(eshell project-eshell overwrite-mode iconify-frame diary))
#+end_src

** The =init.el= section for using Elapaca package manager (~elpaca~)

#+begin_src emacs-lisp :tangle "init.el"
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
  (setq warning-suppress-log-types '((elpaca)))

  (elpaca elpaca-use-package
    (elpaca-use-package-mode))

  (setq use-package-always-ensure t)
#+end_src

** The =init.el= section for fixing PATH on OSX (~exec-path-from-shell~)

The ~PATH~ variable does not get set properly on Mac OSX and Windows machines, and due to this Emacs often does not find the right executables when calling external programs. ~exec-path-from-shell~ fixes this.

#+begin_src emacs-lisp :tangle "init.el"
  (use-package exec-path-from-shell
    :if (memq (window-system) '(mac ns))
    :ensure t
    :demand t
    :config
    (exec-path-from-shell-initialize))
#+end_src

** The =init.el= section to add modules folder to load-path

#+begin_src emacs-lisp :tangle "init.el"
  (add-to-list 'load-path (expand-file-name "pratik-modules/" user-emacs-directory))
#+end_src

** The =init.el= section to load individual modules
#+begin_src emacs-lisp :tangle "init.el"
  (require 'pratik-theme)
  (require 'pratik-essentials)
  (require 'pratik-completion)
  (require 'pratik-dev)
  (require 'pratik-org)
  (require 'pratik-shell)
#+end_src

** The =init.el= section to turn off debug on error

~debug-on-error~ was turned on in the =early-init.el= file. Since all the modules are loaded at this point without any errors, that flag can now be turned off.

#+begin_src emacs-lisp :tangle "init.el"
  (setq debug-on-error nil)
#+end_src

** Finally, the =init.el= section for local variables
#+begin_src emacs-lisp :tangle "init.el"
  ;; Local Variables:
  ;; no-byte-compile: t
  ;; no-native-compile: t
  ;; no-update-autoloads: t
  ;; End:
#+end_src


* The =pratik-theme.el= module

This module defines everything related to the look and feel of Emacs.

** The =pratik-theme.el= section for themes (~doom-themes~)

~doom-themes~ package provides a bunch of different themes to choose from and are by default compatible with ~solaire-mode~.

#+begin_src emacs-lisp :tangle "pratik-modules/pratik-theme.el" :mkdirp yes
  ;; pratik-theme.el -*- lexical-binding: t; -*-

  (use-package doom-themes
    :config
    (doom-themes-org-config))
#+end_src

#+begin_src emacs-lisp :tangle "pratik-modules/pratik-theme.el"
  ;;; The Ef (εὖ) themes

;; The themes are customisable.  Read the manual:
;; <https://protesilaos.com/emacs/ef-themes>.
(use-package ef-themes
  :ensure t
  :demand t
  :bind
  (("<f5>" . ef-themes-rotate)
   ("C-<f5>" . ef-themes-select))
  :config
  (setq ef-themes-variable-pitch-ui nil)
  (setq ef-themes-mixed-fonts t)
  (setq ef-themes-headings      ; read the manual's entry of the doc string
        '((0 . (variable-pitch light 1.6))
          (1 . (variable-pitch light 1.5))
          (2 . (variable-pitch regular 1.4))
          (3 . (variable-pitch regular 1.3))
          (4 . (variable-pitch regular 1.2))
          (5 . (variable-pitch 1.15))  ; absence of weight means `bold'
          (6 . (variable-pitch 1.1))
          (agenda-date . (semilight 1.3))
          (agenda-structure . (light 1.6))
          (t . (1.1))))
  (setq ef-themes-disable-other-themes t)
  (mapc #'disable-theme custom-enabled-themes))
#+end_src

